Finding Missing Values

In [ ]:
import pandas as pd
data={
    "Name":["Shree","Anu",None,"Ritu","Gyan"],
    "City":["Indore",None,"Dhar",None,"Delhi"],
    "DOB":[2003,None,1998,1995,2000],
    "Salary":[20000,10000,30000,None,23000]
}
df=pd.DataFrame(data)
print(df.isnull())         #true means none value
print()
print("No. of none values")
print(df.isnull().sum())

    Name   City    DOB  Salary
0  False  False  False   False
1  False   True   True   False
2   True  False  False   False
3  False   True  False    True
4  False  False  False   False

No. of none values
Name      1
City      2
DOB       1
Salary    1
dtype: int64

Handling Missing Values

In [ ]:
import pandas as pd
data={
    "Name":["Shree","Anu",None,"Ritu","Gyan"],
    "City":["Indore",None,None,"Dhar","Delhi"],
    "DOB":[2003,None,None,1995,2000],
    "Salary":[20000,10000,None,None,23000]
}
df=pd.DataFrame(data)

#df.dropna(axis=0,inplace=True)     #remove each row which has none value
print(df) 
print()
#print(df.dropna(how='all'))    #remove row which has all elements null
print()
print(df.dropna(thresh=2))    #remove row which has 2 null elements 
print()

    Name    City     DOB   Salary
0  Shree  Indore  2003.0  20000.0
1    Anu    None     NaN  10000.0
2   None    None     NaN      NaN
3   Ritu    Dhar  1995.0      NaN
4   Gyan   Delhi  2000.0  23000.0


    Name    City     DOB   Salary
0  Shree  Indore  2003.0  20000.0
1    Anu    None     NaN  10000.0
3   Ritu    Dhar  1995.0      NaN
4   Gyan   Delhi  2000.0  23000.0

fillna method

In [ ]:
print(df)
print()

#print(df.fillna(0,inplace=True))

'''df['DOB'].fillna(df['DOB'].mean())
df['Salary'].fillna(df['Salary'].mean())'''
g=df.fillna({
    'DOB' : '2000',
    'Salary' : df.Salary.mean(),
    'City' : 'Dhar',
    'Name' : 'Shree'
})
print(g)
print("forward fill")
#forward fill
print(df.ffill(limit=2))
print("backward fill")
#backward fill
print(df.bfill(axis='columns'))

    Name    City     DOB   Salary
0  Shree  Indore  2003.0  20000.0
1    Anu    None     NaN  10000.0
2   None    Dhar     NaN      NaN
3   Ritu    None  1995.0      NaN
4   Gyan   Delhi  2000.0  23000.0

    Name    City     DOB        Salary
0  Shree  Indore  2003.0  20000.000000
1    Anu    Dhar    2000  10000.000000
2  Shree    Dhar    2000  17666.666667
3   Ritu    Dhar  1995.0  17666.666667
4   Gyan   Delhi  2000.0  23000.000000
forward fill
    Name    City     DOB   Salary
0  Shree  Indore  2003.0  20000.0
1    Anu  Indore  2003.0  10000.0
2    Anu    Dhar  2003.0  10000.0
3   Ritu    Dhar  1995.0  10000.0
4   Gyan   Delhi  2000.0  23000.0
backward fill
    Name     City      DOB   Salary
0  Shree   Indore   2003.0  20000.0
1    Anu  10000.0  10000.0  10000.0
2   Dhar     Dhar      NaN      NaN
3   Ritu   1995.0   1995.0      NaN
4   Gyan    Delhi   2000.0  23000.0

replace fxn

In [ ]:
import pandas as pd
import numpy as np
data={
    "Name":["Shree","Anu",None,"Ritu","Gyan"],
    "City":["Indore",None,None,"Dhar","Delhi"],
    "DOB":[2003,-222,-333,1995,2000],
    "Salary":[20000,10000,-333,-222,23000]
}
df=pd.DataFrame(data)
print(df)
print()
#print(df.replace(-222,np.nan)) 
g=df.replace({
    -333 : '00',
    -222 : '000'
})
print(g)

    Name    City   DOB  Salary
0  Shree  Indore  2003   20000
1    Anu    None  -222   10000
2   None    None  -333    -333
3   Ritu    Dhar  1995    -222
4   Gyan   Delhi  2000   23000

    Name    City   DOB Salary
0  Shree  Indore  2003  20000
1    Anu    None   000  10000
2   None    None    00     00
3   Ritu    Dhar  1995    000
4   Gyan   Delhi  2000  23000